results/fabio-512-run02/003_fio/cmd_162.output
io_uring-xnvme: (g=0): rw=randread, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=xnvme, iodepth=2
fio-3.32-dirty
Starting 1 thread
{
  "fio version" : "fio-3.32-dirty",
  "timestamp" : 1666789917,
  "timestamp_ms" : 1666789917192,
  "time" : "Wed Oct 26 15:11:57 2022",
  "jobs" : [
    {
      "jobname" : "io_uring-xnvme",
      "groupid" : 0,
      "error" : 0,
      "eta" : 0,
      "elapsed" : 11,
      "job options" : {
        "name" : "io_uring-xnvme",
        "rw" : "randread",
        "size" : "12G",
        "iodepth" : "2",
        "bs" : "512",
        "direct" : "1",
        "thread" : "1",
        "time_based" : "1",
        "runtime" : "7",
        "ramp_time" : "3",
        "norandommap" : "1",
        "allow_file_create" : "0",
        "ioengine" : "external:/usr/local/lib/x86_64-linux-gnu/libxnvme-fio-engine.so",
        "xnvme_be" : "linux",
        "xnvme_async" : "io_uring",
        "xnvme_sync" : "nvme",
        "xnvme_admin" : "nvme",
        "xnvme_dev_nsid" : "1",
        "filename" : "/dev/nvme0n1",
        "cpus_allowed" : "1"
      },
      "read" : {
        "io_bytes" : 754146304,
        "io_kbytes" : 736471,
        "bw_bytes" : 107735186,
        "bw" : 105210,
        "iops" : 210420.142857,
        "runtime" : 7000,
        "total_ios" : 1472941,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 1373,
          "max" : 39404,
          "mean" : 1621.156412,
          "stddev" : 192.150453,
          "N" : 1472941
        },
        "clat_ns" : {
          "min" : 180,
          "max" : 110587,
          "mean" : 7626.157111,
          "stddev" : 2228.400265,
          "N" : 1472942,
          "percentile" : {
            "1.000000" : 5216,
            "5.000000" : 5280,
            "10.000000" : 5344,
            "20.000000" : 5472,
            "30.000000" : 6752,
            "40.000000" : 7264,
            "50.000000" : 7456,
            "60.000000" : 7712,
            "70.000000" : 8096,
            "80.000000" : 9280,
            "90.000000" : 9408,
            "95.000000" : 9664,
            "99.000000" : 16768,
            "99.500000" : 18560,
            "99.900000" : 23936,
            "99.950000" : 24448,
            "99.990000" : 61696
          }
        },
        "lat_ns" : {
          "min" : 5741,
          "max" : 112090,
          "mean" : 9247.313388,
          "stddev" : 2260.379617,
          "N" : 1472942
        },
        "bw_min" : 104853,
        "bw_max" : 105510,
        "bw_agg" : 100.000000,
        "bw_mean" : 105237.769231,
        "bw_dev" : 207.918716,
        "bw_samples" : 13,
        "iops_min" : 209706,
        "iops_max" : 211020,
        "iops_mean" : 210475.769231,
        "iops_stddev" : 415.849162,
        "iops_samples" : 13
      },
      "write" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "trim" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "sync" : {
        "total_ios" : 0,
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        }
      },
      "job_runtime" : 7000,
      "usr_cpu" : 14.157143,
      "sys_cpu" : 51.885714,
      "ctx" : 740379,
      "majf" : 0,
      "minf" : 0,
      "iodepth_level" : {
        "1" : 0.000000,
        "2" : 100.000000,
        "4" : 0.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_submit" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_complete" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "latency_ns" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.010000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 0.010000,
        "10" : 97.277556,
        "20" : 2.467716,
        "50" : 0.220783,
        "100" : 0.024101,
        "250" : 0.010000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_ms" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 2,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    }
  ]
}

io_uring-xnvme: (groupid=0, jobs=1): err= 0: pid=7683: Wed Oct 26 15:11:57 2022
  read: IOPS=210k, BW=103MiB/s (108MB/s)(719MiB/7000msec)
    slat (nsec): min=1373, max=39404, avg=1621.16, stdev=192.15
    clat (nsec): min=180, max=110587, avg=7626.16, stdev=2228.40
     lat (usec): min=5, max=112, avg= 9.25, stdev= 2.26
    clat percentiles (nsec):
     |  1.00th=[ 5216],  5.00th=[ 5280], 10.00th=[ 5344], 20.00th=[ 5472],
     | 30.00th=[ 6752], 40.00th=[ 7264], 50.00th=[ 7456], 60.00th=[ 7712],
     | 70.00th=[ 8096], 80.00th=[ 9280], 90.00th=[ 9408], 95.00th=[ 9664],
     | 99.00th=[16768], 99.50th=[18560], 99.90th=[23936], 99.95th=[24448],
     | 99.99th=[61696]
   bw (  KiB/s): min=104853, max=105510, per=100.00%, avg=105237.77, stdev=207.92, samples=13
   iops        : min=209706, max=211020, avg=210475.77, stdev=415.85, samples=13
  lat (nsec)   : 250=0.01%
  lat (usec)   : 4=0.01%, 10=97.28%, 20=2.47%, 50=0.22%, 100=0.02%
  lat (usec)   : 250=0.01%
  cpu          : usr=14.16%, sys=51.89%, ctx=740379, majf=0, minf=0
  IO depths    : 1=0.0%, 2=100.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1472941,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=2

Run status group 0 (all jobs):
   READ: bw=103MiB/s (108MB/s), 103MiB/s-103MiB/s (108MB/s-108MB/s), io=719MiB (754MB), run=7000-7000msec